{"status":"ok","feed":{"url":"https://medium.com/feed/@@khkiran01","title":"Stories by Kiran Khanna on Medium","link":"https://medium.com/@khkiran01?source=rss-950bbd84ad0------2","author":"","description":"Stories by Kiran Khanna on Medium","image":"https://cdn-images-1.medium.com/fit/c/150/150/0*q3TR_PXinPlWBMZd"},"items":[{"title":"Generate your LLM App in minutes","pubDate":"2024-03-11 19:16:02","link":"https://medium.com/@khkiran01/partyrock-generative-ai-by-aws-3dbe01ac99d5?source=rss-950bbd84ad0------2","guid":"https://medium.com/p/3dbe01ac99d5","author":"Kiran Khanna","thumbnail":"","description":"\n<p>LLM models which are known as Large Language Models have again more attention from society ,since, the release of ChatGPT by OPEN AI</p>\n<p>As an AI enthusiast , I like exploring different models of LLM and participate in various hackathons .</p>\n<p>While look for different ai hackathons , I came across the PartyRocks Hackathon by AWS . I tried to learn about the PartyRocks resource and app , whenever I found time . It was amazing to think that your idea can be convert into the app in just few minutes ,with the help of PartyRock app .I played around with app and it’s different features and then came up with the idea to submit my idea in a hackathon.</p>\n<p>In PartyRock we can create our app from starting or remix it(edit the existing app by adding your features) .</p>\n<p>The Link to the PartyRocks</p>\n<p><a href=\"https://partyrock.aws/\">PartyRock</a></p>\n<p>Thank you for taking out some time and reading my blog .</p>\n<p>Please Like , Comment and Follow.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3dbe01ac99d5\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p>LLM models which are known as Large Language Models have again more attention from society ,since, the release of ChatGPT by OPEN AI</p>\n<p>As an AI enthusiast , I like exploring different models of LLM and participate in various hackathons .</p>\n<p>While look for different ai hackathons , I came across the PartyRocks Hackathon by AWS . I tried to learn about the PartyRocks resource and app , whenever I found time . It was amazing to think that your idea can be convert into the app in just few minutes ,with the help of PartyRock app .I played around with app and it’s different features and then came up with the idea to submit my idea in a hackathon.</p>\n<p>In PartyRock we can create our app from starting or remix it(edit the existing app by adding your features) .</p>\n<p>The Link to the PartyRocks</p>\n<p><a href=\"https://partyrock.aws/\">PartyRock</a></p>\n<p>Thank you for taking out some time and reading my blog .</p>\n<p>Please Like , Comment and Follow.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3dbe01ac99d5\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["aws","llm","party-rock","ai","aws-partyrock"]},{"title":"Google has unveiled the Pixel 8, a smartwatch equipped with innovative AI capabilities","pubDate":"2023-10-04 18:05:10","link":"https://medium.com/@khkiran01/google-has-unveiled-the-pixel-8-a-smartwatch-equipped-with-innovative-ai-capabilities-d7e5496f4176?source=rss-950bbd84ad0------2","guid":"https://medium.com/p/d7e5496f4176","author":"Kiran Khanna","thumbnail":"","description":"\n<p>Generative AI Already available at phones</p>\n<p><strong>“Generative Started getting more focused after release of chatGPT , right now ever company is in competition in using generative AI “</strong></p>\n<p>Alphabet’s Google unveiled the Pixel 8 smartphones and a new wristwatch on Wednesday, deepening the company’s integration of artificial intelligence technology into its main consumer goods. The improvements to the Pixel phones, which are popular among photography aficionados and those who like the stock Android experience, may make them more appealing to holiday buyers.</p>\n<p>It will assist consumers in achieving new AI functions such as photography, web page summarization, and spam call prevention, officials claimed at a Made by Google event on Thursday</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*SGrVNIgDX4x-8kEG.jpg\"></figure><p>The new Pixel 8 Mobile phone will be having the hole set of different Generative AI usecases</p>\n<p>The higher-end Pixel 8 Pro also gets a temperature sensor and Google said it had filed an application with the FDA to enable the Thermometer App to take body temperature.</p>\n<p>Pixel 8 starts at $699 and Pixel 8 Pro at $999 — $100 pricier than the previous generation models. They will be available from Oct. 12.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d7e5496f4176\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p>Generative AI Already available at phones</p>\n<p><strong>“Generative Started getting more focused after release of chatGPT , right now ever company is in competition in using generative AI “</strong></p>\n<p>Alphabet’s Google unveiled the Pixel 8 smartphones and a new wristwatch on Wednesday, deepening the company’s integration of artificial intelligence technology into its main consumer goods. The improvements to the Pixel phones, which are popular among photography aficionados and those who like the stock Android experience, may make them more appealing to holiday buyers.</p>\n<p>It will assist consumers in achieving new AI functions such as photography, web page summarization, and spam call prevention, officials claimed at a Made by Google event on Thursday</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*SGrVNIgDX4x-8kEG.jpg\"></figure><p>The new Pixel 8 Mobile phone will be having the hole set of different Generative AI usecases</p>\n<p>The higher-end Pixel 8 Pro also gets a temperature sensor and Google said it had filed an application with the FDA to enable the Thermometer App to take body temperature.</p>\n<p>Pixel 8 starts at $699 and Pixel 8 Pro at $999 — $100 pricier than the previous generation models. They will be available from Oct. 12.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d7e5496f4176\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["googlepixel8","generative-ai-tools","phone","ai","google-pixel"]},{"title":"A Deep Dive into the Technical Details of ChatGPT and How it Works","pubDate":"2023-02-08 05:28:39","link":"https://medium.com/@khkiran01/a-deep-dive-into-the-technical-details-of-chatgpt-and-how-it-works-3ec1114271bf?source=rss-950bbd84ad0------2","guid":"https://medium.com/p/3ec1114271bf","author":"Kiran Khanna","thumbnail":"","description":"\n<p>ChatGPT is a cutting-edge language model created by OpenAI, one of the top groups in the field of artificial intelligence. This model is capable of creating human-like text answers in a conversational way, making it a highly sought-after tool for a wide range of applications.</p>\n<p>In this blog, we will go into the technical intricacies of ChatGPT and how it works.</p>\n<p>ChatGPT is a sort of transformer network, a deep learning architecture that has transformed the area of natural language processing (Natural Language Processing). The model is trained on a vast corpus of text data, allowing it to understand language patterns and provide coherent and appropriate answers to the input it receives.</p>\n<p>ChatGPT is fine-tuned utilizing a training target known as a “sequence to sequence” (Seq2Seq). Given the previous tokens as input, the model is trained to predict the next token in a sequence. The model is fed a huge corpus of text data during training and is tuned to minimize the difference between its generated outputs and the intended outputs.</p>\n<p>Once trained, the model may be utilized for a variety of applications, including but not limited to chatbots, virtual assistants, content production, and others. When used for inference, the model receives a prompt or question as input and outputs a conversational answer.</p>\n<p>Finally, ChatGPT is a complex language model capable of producing human-like text answers. It is built on the transformer architecture and employs attention mechanisms, which allow the model to focus on certain sections of the input while producing output. ChatGPT offers a wide range of possible applications in areas such as customer service, content development, and research due to its ability to provide contextually appropriate replies.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3ec1114271bf\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p>ChatGPT is a cutting-edge language model created by OpenAI, one of the top groups in the field of artificial intelligence. This model is capable of creating human-like text answers in a conversational way, making it a highly sought-after tool for a wide range of applications.</p>\n<p>In this blog, we will go into the technical intricacies of ChatGPT and how it works.</p>\n<p>ChatGPT is a sort of transformer network, a deep learning architecture that has transformed the area of natural language processing (Natural Language Processing). The model is trained on a vast corpus of text data, allowing it to understand language patterns and provide coherent and appropriate answers to the input it receives.</p>\n<p>ChatGPT is fine-tuned utilizing a training target known as a “sequence to sequence” (Seq2Seq). Given the previous tokens as input, the model is trained to predict the next token in a sequence. The model is fed a huge corpus of text data during training and is tuned to minimize the difference between its generated outputs and the intended outputs.</p>\n<p>Once trained, the model may be utilized for a variety of applications, including but not limited to chatbots, virtual assistants, content production, and others. When used for inference, the model receives a prompt or question as input and outputs a conversational answer.</p>\n<p>Finally, ChatGPT is a complex language model capable of producing human-like text answers. It is built on the transformer architecture and employs attention mechanisms, which allow the model to focus on certain sections of the input while producing output. ChatGPT offers a wide range of possible applications in areas such as customer service, content development, and research due to its ability to provide contextually appropriate replies.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3ec1114271bf\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["chatgpt-side-hustles","chatgpt","more-about-chatgpt","how-does-it-work"]},{"title":"Top 3 Technology","pubDate":"2023-01-30 10:43:41","link":"https://medium.com/@khkiran01/top-3-technology-bee6dd28524?source=rss-950bbd84ad0------2","guid":"https://medium.com/p/bee6dd28524","author":"Kiran Khanna","thumbnail":"","description":"\n<h3>\n<strong>Hello everyone</strong>. I hope everyone is doing well. This is my first blog post, and I hope you all will like it.</h3>\n<p>Please like and comment if you like my blog post.</p>\n<p>Many entirely new technologies have also emerged in the 21st century, particularly in the fields of computer science and engineering. These new technologies are only expected to expand and perhaps even reach the hands of the average person by 2030.</p>\n<p>Here are some of the top technologies that are widely used and in demand in the tech industry:</p>\n<h3>1. Artificial Intelligence (AI):</h3>\n<p>Artificial Intelligence (AI) is a branch of computer science that focuses on creating intelligent machines that can perform tasks that typically require human intelligence. AI involves developing algorithms and models that can learn from data and make decisions based on that data.</p>\n<p>There are different approaches to AI, including:</p>\n<ol>\n<li>Machine Learning (ML): ML is a subfield of AI that involves training algorithms to learn patterns in data. It involves creating models that can automatically improve their accuracy over time as they receive more data.</li>\n<li>Natural Language Processing (NLP): NLP is a branch of AI that involves enabling computers to understand, interpret, and generate human language. NLP is widely used in applications such as speech recognition, machine translation, and sentiment analysis.</li>\n<li>Computer Vision: Computer vision is a branch of AI that involves enabling computers to process, understand, and analyze visual information. Computer vision is widely used in applications such as image recognition, object detection, and facial recognition.</li>\n<li>Robotics: Robotics is a branch of AI that involves creating robots that can perform tasks in the physical world. Robotics involves combining AI techniques such as computer vision, machine learning, and control systems to create robots that can interact with their environment.</li>\n</ol>\n<p>AI has the potential to transform a variety of sectors, including healthcare, banking, transportation, and retail. AI has the potential to automate processes, improve the predictability of outcomes, and offer information that may guide business decisions.</p>\n<p>AI does, however, also bring up significant ethical and societal issues, such as privacy, justice, and responsibility. To guarantee that AI is created and deployed in ways that are moral, responsible, and advantageous to society, it is crucial for academics, practitioners, and politicians to collaborate.</p>\n<h3>2. Cloud Computing:</h3>\n<p>Cloud computing is a technology that allows users to access and store data and applications on remote servers over the internet, instead of on their own computers or local servers.</p>\n<p>The data and applications are stored on servers that are owned and maintained by a third-party cloud service provider. This provider is responsible for the security, maintenance, and management of these servers, allowing users to access their data and applications from anywhere in the world with an internet connection.</p>\n<p>Cloud computing has several benefits, including:</p>\n<ol>\n<li>Scalability: Cloud computing allows users to easily scale their computing resources up or down based on their needs, without having to make a large upfront investment in hardware or infrastructure.</li>\n<li>Cost Savings: By using cloud computing, users can reduce their upfront costs, as well as their ongoing maintenance and support costs, by paying only for the resources they actually use.</li>\n<li>Flexibility: Cloud computing allows users to access their data and applications from anywhere in the world, using any device with an internet connection.</li>\n<li>Reliability: Cloud service providers typically have extensive resources and expertise in data center management and disaster recovery, allowing users to take advantage of their highly reliable and secure infrastructure.</li>\n</ol>\n<p>Cloud computing comes in a variety of flavors, including hybrid, private, and public clouds. Companies like Amazon Web Services (AWS), Microsoft Azure, and Google Cloud offer public cloud services that are intended for use by the general public. Private cloud services are housed on private servers or data centers and are intended for usage by certain companies alone. Organizations may utilize the advantages of both public and private clouds by combining them into a hybrid cloud.</p>\n<p>Today’s corporations, organizations, and people utilize cloud computing extensively for a range of tasks, including data storage, software development, and data analysis. It has emerged as a key technology in the digital world.</p>\n<h3>3. Internet of Things (IoT):</h3>\n<p>The Internet of Things (IoT) is a network of physical devices, vehicles, home appliances, and other items embedded with electronics, software, sensors, and connectivity which enables these objects to connect and exchange data.</p>\n<p>IoT devices are connected to the internet and can communicate with each other and with other devices, allowing for the automation of many everyday tasks and the collection and analysis of large amounts of data.</p>\n<p>IoT has several key benefits, including:</p>\n<ol>\n<li>Increased Efficiency: IoT devices can be programmed to perform specific tasks automatically, reducing the need for manual intervention and increasing efficiency.</li>\n<li>Real-time Monitoring: IoT devices can constantly collect and transmit data, allowing for real-time monitoring of equipment, systems, and processes.</li>\n<li>Improved Decision Making: The data collected by IoT devices can be analyzed to gain insights and make informed decisions, leading to improved outcomes in various industries, such as healthcare, manufacturing, and energy.</li>\n<li>Automated Control: IoT devices can be programmed to control other devices and systems, allowing for the automation of many everyday tasks, such as controlling the temperature in a home or turning off lights when a room is unoccupied.</li>\n<li>Cost Savings: IoT can lead to reduced costs by increasing efficiency, reducing waste, and allowing for more informed decision-making.</li>\n</ol>\n<p>Although IoT is still in its beginnings, it has the potential to transform a wide range of sectors and alter how we live and work. As more and more private and sensitive data is exchanged and stored by IoT devices, there are, however, additional security and privacy risks. To safeguard their data and devices, it is crucial for businesses and people to take into account potential dangers and put in place suitable security measures.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=bee6dd28524\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<h3>\n<strong>Hello everyone</strong>. I hope everyone is doing well. This is my first blog post, and I hope you all will like it.</h3>\n<p>Please like and comment if you like my blog post.</p>\n<p>Many entirely new technologies have also emerged in the 21st century, particularly in the fields of computer science and engineering. These new technologies are only expected to expand and perhaps even reach the hands of the average person by 2030.</p>\n<p>Here are some of the top technologies that are widely used and in demand in the tech industry:</p>\n<h3>1. Artificial Intelligence (AI):</h3>\n<p>Artificial Intelligence (AI) is a branch of computer science that focuses on creating intelligent machines that can perform tasks that typically require human intelligence. AI involves developing algorithms and models that can learn from data and make decisions based on that data.</p>\n<p>There are different approaches to AI, including:</p>\n<ol>\n<li>Machine Learning (ML): ML is a subfield of AI that involves training algorithms to learn patterns in data. It involves creating models that can automatically improve their accuracy over time as they receive more data.</li>\n<li>Natural Language Processing (NLP): NLP is a branch of AI that involves enabling computers to understand, interpret, and generate human language. NLP is widely used in applications such as speech recognition, machine translation, and sentiment analysis.</li>\n<li>Computer Vision: Computer vision is a branch of AI that involves enabling computers to process, understand, and analyze visual information. Computer vision is widely used in applications such as image recognition, object detection, and facial recognition.</li>\n<li>Robotics: Robotics is a branch of AI that involves creating robots that can perform tasks in the physical world. Robotics involves combining AI techniques such as computer vision, machine learning, and control systems to create robots that can interact with their environment.</li>\n</ol>\n<p>AI has the potential to transform a variety of sectors, including healthcare, banking, transportation, and retail. AI has the potential to automate processes, improve the predictability of outcomes, and offer information that may guide business decisions.</p>\n<p>AI does, however, also bring up significant ethical and societal issues, such as privacy, justice, and responsibility. To guarantee that AI is created and deployed in ways that are moral, responsible, and advantageous to society, it is crucial for academics, practitioners, and politicians to collaborate.</p>\n<h3>2. Cloud Computing:</h3>\n<p>Cloud computing is a technology that allows users to access and store data and applications on remote servers over the internet, instead of on their own computers or local servers.</p>\n<p>The data and applications are stored on servers that are owned and maintained by a third-party cloud service provider. This provider is responsible for the security, maintenance, and management of these servers, allowing users to access their data and applications from anywhere in the world with an internet connection.</p>\n<p>Cloud computing has several benefits, including:</p>\n<ol>\n<li>Scalability: Cloud computing allows users to easily scale their computing resources up or down based on their needs, without having to make a large upfront investment in hardware or infrastructure.</li>\n<li>Cost Savings: By using cloud computing, users can reduce their upfront costs, as well as their ongoing maintenance and support costs, by paying only for the resources they actually use.</li>\n<li>Flexibility: Cloud computing allows users to access their data and applications from anywhere in the world, using any device with an internet connection.</li>\n<li>Reliability: Cloud service providers typically have extensive resources and expertise in data center management and disaster recovery, allowing users to take advantage of their highly reliable and secure infrastructure.</li>\n</ol>\n<p>Cloud computing comes in a variety of flavors, including hybrid, private, and public clouds. Companies like Amazon Web Services (AWS), Microsoft Azure, and Google Cloud offer public cloud services that are intended for use by the general public. Private cloud services are housed on private servers or data centers and are intended for usage by certain companies alone. Organizations may utilize the advantages of both public and private clouds by combining them into a hybrid cloud.</p>\n<p>Today’s corporations, organizations, and people utilize cloud computing extensively for a range of tasks, including data storage, software development, and data analysis. It has emerged as a key technology in the digital world.</p>\n<h3>3. Internet of Things (IoT):</h3>\n<p>The Internet of Things (IoT) is a network of physical devices, vehicles, home appliances, and other items embedded with electronics, software, sensors, and connectivity which enables these objects to connect and exchange data.</p>\n<p>IoT devices are connected to the internet and can communicate with each other and with other devices, allowing for the automation of many everyday tasks and the collection and analysis of large amounts of data.</p>\n<p>IoT has several key benefits, including:</p>\n<ol>\n<li>Increased Efficiency: IoT devices can be programmed to perform specific tasks automatically, reducing the need for manual intervention and increasing efficiency.</li>\n<li>Real-time Monitoring: IoT devices can constantly collect and transmit data, allowing for real-time monitoring of equipment, systems, and processes.</li>\n<li>Improved Decision Making: The data collected by IoT devices can be analyzed to gain insights and make informed decisions, leading to improved outcomes in various industries, such as healthcare, manufacturing, and energy.</li>\n<li>Automated Control: IoT devices can be programmed to control other devices and systems, allowing for the automation of many everyday tasks, such as controlling the temperature in a home or turning off lights when a room is unoccupied.</li>\n<li>Cost Savings: IoT can lead to reduced costs by increasing efficiency, reducing waste, and allowing for more informed decision-making.</li>\n</ol>\n<p>Although IoT is still in its beginnings, it has the potential to transform a wide range of sectors and alter how we live and work. As more and more private and sensitive data is exchanged and stored by IoT devices, there are, however, additional security and privacy risks. To safeguard their data and devices, it is crucial for businesses and people to take into account potential dangers and put in place suitable security measures.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=bee6dd28524\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["top3technology","ai","technology","tech"]}]}